public class CommentsForEgor {

    //Короче, иду по такому плану от джемени
    //У тебя в тз этого нет, по крайней мере на 0 этапе, но
    //Она яростно советует делать кастомные ошибки, чтоб понимать что к чему, если они будут
    //Поэтому я сделаю это после заданий основного этапа (0_0)

//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    //https://www.youtube.com/watch?v=JW5LH6Zncn4
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    //https://www.youtube.com/watch?v=AUgCywddjMY
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

//И с гитом тоже завтра
    //src/
    //├── model/        (Готово ✅)
    //├── repository/   (Готово ✅)
    //│
    //├── exception/    <-- создаем пакет с кастомными ошибками
    //│   ├── BookingConflictException.java
    //│   └── EntityNotFoundException.java
    //│
    //├── service/      <-- создаем пакет с бизнес-логикой
    //│   └── BookingService.java
    //│
    //└── Main.java     <-- точка входа с консольным меню
}
